# hometask
num1 = 10
num2 = 20

# Напишите код для сложения 2-х чисел
result = num1 + num2
print("Сумма двух чисел:", result)

# Напишите код для вычитания 2-х чисел
result = num1 - num2
print("Разница в двух числах:", result)

# Напишите код для умножения 2-х чисел
result = num1 * num2
print("Умножение двух чисел:", result)

# Напишите код для деления 2-х чисел
result = num1 / num2
print("Делитель двух чисел:", result)

# Напишите код для сложения 2-х строк, что получилось?
str1 = "Hello, "
str2 = "World!"
result = str1 + str2
print(result)

# Напишите код для сложения строки и числа, чем это все закончилось?
num1 = "10"
result = str1 + num1
print(result)

# Выведите на экран результат сложения 2-х чисел
num1 = 10
num2 = 20
num1 += num2
print("Сумма двух чисел:",num1)


# Почему ускоряется скорость выполнения кода?
# Такие операторы, как +=, =, = и /=, могут сделать код более «Pythonic»,
# что означает, что код является более простым и доступным.
# Эти операторы не создают новых переменных, обновляя их, таким образом сохраняя память,
# и могут увеличить скорость выполнения кода при обработке больших данных.

num1 = 10
num2 = 20
# Выведите на экран результат вычитания 2-х чисел с помощью оператора -=
num1 -= num2
print(num1)

# Выведите на экран результат умножения 2-х чисел с помощью оператора *=
num1 *= num2
print(num1)

# Выведите на экран результат деления 2-х чисел с помощью оператора /=
num1 /= num2
print(num1)